<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 120.0.2210.133--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Paramètres de remplacement du chargeur</string><string id="BrowserExecutableFolder">Configurer l’emplacement du dossier exécutable du navigateur</string><string id="BrowserExecutableFolder_Explain">Cette stratégie configure les applications WebView2 pour utiliser le runtime WebView2 dans le chemin d’accès spécifié. Le dossier doit contenir les fichiers suivants : msedgewebview2.exe, msedge.dll, etc.

Pour définir la valeur du chemin d’accès au dossier, fournissez un nom et une paire valeur. Attribuez à nom de la valeur l’ID de modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.

Exemple de valeur :

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Configurer l’emplacement du dossier exécutable du navigateur</string><string id="ReleaseChannelPreference">Définition de la préférence d’ordre de recherche de canaux de publication</string><string id="ReleaseChannelPreference_Explain">L’ordre de recherche des canaux par défaut est WebView2 Runtime, Beta, Dev et Canary.

Pour annuler l’ordre de recherche par défaut, attribuez la valeur 1 à cette stratégie.

Pour définir la valeur de la préférence de canal de publication, fournissez un nom de valeur et une paire de valeur. Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.

Exemple de valeur :

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Définition de la préférence d’ordre de recherche de canaux de publication</string><string id="ExperimentationAndConfigurationServiceControl">Contrôler la communication avec le service d’expérimentation et de configuration</string><string id="ExperimentationAndConfigurationServiceControl_Explain">Le service d'expérimentation et de configuration est utilisé pour déployer les charges utiles d'expérimentation et de configuration sur le client.

Les charges utiles d'expérimentation consistent en une liste de fonctions en début de développement que Microsoft Corporation active pour les tester et obtenir un retour d'information.

  Les données utiles de configuration consistent en une liste de paramètres recommandés que Microsoft Corporation souhaite déployer pour optimiser l'expérience utilisateur.

    Les données utiles de configuration peuvent également contenir une liste d'actions à entreprendre sur certains domaines pour des raisons de compatibilité. Par exemple, le navigateur peut remplacer la chaîne User Agent d'un site Web si ce dernier n'est pas compatible. Chacune de ces actions est censée être temporaire pendant que Microsoft Corporation tente de résoudre le problème avec le propriétaire du site.

     Si vous définissez cette stratégie sur « FullMode », la charge utile complète est téléchargée depuis le service d'expérimentation et de configuration. Cela inclut les charges utiles d'expérimentation et de configuration.

    Si vous définissez cette stratégie sur « ConfigurationsOnlyMode », seuls les fichiers utiles de configuration sont téléchargés.

     Si vous définissez cette stratégie sur &quot;RestrictedMode&quot;, la communication avec le service d'expérimentation et de configuration est complètement interrompue. Microsoft Corporation ne recommande pas ce paramètre.

     Si vous ne configurez pas cette stratégie sur un dispositif géré, le comportement sur les canaux Beta et Stable est le même que celui du 'ConfigurationsOnlyMode'. Sur les canaux Canary et Dev, le comportement est le même que celui du « FullMode ».

     Si vous ne configurez pas cette politique sur un dispositif non géré, le comportement est le même que celui du « FullMode ».

Mappage des options de stratégie :

* FullMode (2) = Récupérer les configurations et les expérimentations

* ConfigurationsOnlyMode (1) = Récupérer les configurations uniquement

* RestrictedMode (0) = Désactiver la communication avec le service d’expérimentation et de configuration

Utilisez les informations ci-dessus lors de la configuration de cette stratégie.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Récupérer les configurations et les expérimentations</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Récupérer les configurations uniquement</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Désactiver la communication avec le service d’expérimentation et de configuration</string><string id="ForcePermissionPolicyUnloadDefaultEnabled">Contrôle si les gestionnaires d’événements unload peuvent être désactivés.</string><string id="ForcePermissionPolicyUnloadDefaultEnabled_Explain">unload les gestionnaires d’événements sont déconseillés. Leur déclenchement dépend de unload Permissions-Policy.
Actuellement, ils sont autorisés par la stratégie par défaut. À l’avenir, ils seront progressivement interdits par défaut et les sites devront les activer explicitement à l’aide des Permissions-Policy en-têtes.
Vous pouvez utiliser cette stratégie d’entreprise pour refuser cette désapprobation progressive en forçant la valeur par défaut à rester activée.

Les pages peuvent dépendre des gestionnaires d’événements unload pour enregistrer des données ou signaler la fin d’une session utilisateur au serveur.
Cette opération n’est pas recommandée, car elle n’est pas fiable et affecte les performances en bloquant l’utilisation de BackForwardCache.
Il existe des alternatives recommandées, mais l’événement unload a été utilisé depuis longtemps. Certaines applications peuvent encore s’appuyer sur elles.

Si vous désactivez cette stratégie ou ne la configurez pas, les gestionnaires d’événements unload seront progressivement déconseillés conformément au déploiement prévu de la désapprobation et les sites qui ne définissent pas l’en-tête Permissions-Policy cesseront de déclencher des événements de « déchargement ».

Si vous activez cette stratégie, alors les gestionnaires d’événements unload continueront à fonctionner par défaut.</string><string id="NewPDFReaderWebView2List">Activer le lecteur PDF intégré optimisé par Adobe Acrobat pour WebView2</string><string id="NewPDFReaderWebView2List_Explain">Cette stratégie configure les applications WebView2 pour qu'elles lancent la nouvelle version du lecteur PDF qui est alimentée par Adobe Acrobat's PDF reader. Le nouveau lecteur PDF garantit qu'il n'y a pas de perte de fonctionnalité et offre une expérience PDF améliorée. Cette expérience comprend un rendu plus riche, des performances améliorées, une sécurité renforcée pour le traitement des fichiers PDF et une plus grande accessibilité.

Si cette stratégie est spécifiée pour une application, il est possible qu'elle ait également un impact sur d'autres applications connexes. La politique est appliquée à tous les WebView2 qui partagent le même dossier de données utilisateur WebView2. Ces WebView2 peuvent potentiellement appartenir à plusieurs applications si ces applications, qui appartiennent probablement à la même famille de produits, sont conçues pour partager le même dossier de données utilisateur.

Utilisez une paire nom-valeur pour activer le nouveau lecteur PDF pour l'application. Définissez le nom comme étant l'ID du modèle d'utilisateur de l'application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique &quot;*&quot; comme nom de valeur pour l'appliquer à toutes les applications. Définissez la valeur sur true pour activer le nouveau lecteur ou sur false pour utiliser le lecteur existant.

Si vous activez cette politique pour les applications WebView2 spécifiées, elles utiliseront le nouveau lecteur PDF propulsé par Adobe Acrobat pour ouvrir tous les fichiers PDF.

Si vous désactivez la politique pour les applications WebView2 spécifiées ou si vous ne la configurez pas, elles utiliseront le lecteur PDF existant pour ouvrir tous les fichiers PDF.

Exemple de valeur :

{&quot;name&quot;: &quot;app1.exe&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;app_id_for_app2&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;*&quot;, &quot;value&quot;: false}</string><string id="NewPDFReaderWebView2ListDesc">Activer le lecteur PDF intégré optimisé par Adobe Acrobat pour WebView2</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge version 97, Windows 7 ou version ultérieure</string><string id="SUPPORTED_WIN7_V116">Microsoft Edge version 116, Windows 7 ou version ultérieure</string><string id="SUPPORTED_WIN7_V118">Microsoft Edge version 118, Windows 7 ou version ultérieure</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge version 87, Windows 7 ou version ultérieure</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Paramètres par défaut (les utilisateurs peuvent les modifier)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Contrôler la communication avec le service d’expérimentation et de configuration</dropdownList></presentation><presentation id="ForcePermissionPolicyUnloadDefaultEnabled"/><presentation id="NewPDFReaderWebView2List"><listBox refId="NewPDFReaderWebView2ListDesc">Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.</listBox></presentation></presentationTable></resources></policyDefinitionResources>